In [1]:
pip install pandas

Requirement already satisfied: pandas in c:\users\cses134\anaconda3\envs\ai\lib\site-packages (2.2.2)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\cses134\anaconda3\envs\ai\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: numpy>=1.22.4 in c:\users\cses134\anaconda3\envs\ai\lib\site-packages (from pandas) (1.23.5)
Requirement already satisfied: pytz>=2020.1 in c:\users\cses134\anaconda3\envs\ai\lib\site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\cses134\anaconda3\envs\ai\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\users\cses134\anaconda3\envs\ai\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [2]:
import pandas as pd

In [3]:
pd.__version__

'2.2.2'

In [4]:
pip install --upgrade pandas --user

Requirement already satisfied: pandas in c:\users\cses134\anaconda3\envs\ai\lib\site-packages (2.2.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\cses134\anaconda3\envs\ai\lib\site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: numpy>=1.22.4 in c:\users\cses134\anaconda3\envs\ai\lib\site-packages (from pandas) (1.23.5)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\cses134\anaconda3\envs\ai\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\cses134\anaconda3\envs\ai\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\users\cses134\anaconda3\envs\ai\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [45]:
s1=pd.Series(['Siddheswar','Udhayakumar','Manoj','gokul'],index=[1,2,3,4])

In [46]:
print(s1)

1     Siddheswar
2    Udhayakumar
3          Manoj
4          gokul
dtype: object

# DATA FRAME

variable_name=pd.DataFrame(data,column=[column,name])

In [47]:
df1=pd.DataFrame(s1,columns=["Names"])

In [48]:
df1

         Names
1   Siddheswar
2  Udhayakumar
3        Manoj
4        gokul

In [49]:
s2=pd.Series([19,19,19,19],index=[1,2,3,4])

In [50]:
print(s2)

1    19
2    19
3    19
4    19
dtype: int64

In [51]:
df2=pd.DataFrame(s2,columns=["Age"])

In [52]:
df2

   Age
1   19
2   19
3   19
4   19

In [53]:
df1["Age"]=s2

In [54]:
df1

         Names  Age
1   Siddheswar   19
2  Udhayakumar   19
3        Manoj   19
4        gokul   19

In [55]:
s3=pd.Series(['B.Tech','B.Tech','B.Tech','B.Tech'],index=[1,2,3,4])

In [56]:
print(s3)

1    B.Tech
2    B.Tech
3    B.Tech
4    B.Tech
dtype: object

In [57]:
df3=pd.DataFrame(s3,columns=["Degree"])

In [58]:
df3

   Degree
1  B.Tech
2  B.Tech
3  B.Tech
4  B.Tech

In [59]:
df1["Degree"]=s3

In [60]:
df1

         Names  Age  Degree
1   Siddheswar   19  B.Tech
2  Udhayakumar   19  B.Tech
3        Manoj   19  B.Tech
4        gokul   19  B.Tech

In [21]:
s4=pd.Series(['CSE','CSE','CSE','CSE'],index=[1,2,3,4])

In [61]:
print(s4)

1    CSE
2    CSE
3    CSE
4    CSE
dtype: object

In [62]:
df4=pd.DataFrame(s4,columns=["Department"])

In [63]:
df4

  Department
1        CSE
2        CSE
3        CSE
4        CSE

In [64]:
df1["Department"]=s4

In [65]:
df1

         Names  Age  Degree Department
1   Siddheswar   19  B.Tech        CSE
2  Udhayakumar   19  B.Tech        CSE
3        Manoj   19  B.Tech        CSE
4        gokul   19  B.Tech        CSE

In [66]:
Fruits={"seed":{1:"Apple",2:"Orange",3:"Watermelon"},"seedless":{1:"Grapes",2:"Pineapples",3:"Pappaya"}}

In [67]:
df5=pd.DataFrame(Fruits,columns=["seed","seedless"])

In [68]:
df5

         seed    seedless
1       Apple      Grapes
2      Orange  Pineapples
3  Watermelon     Pappaya

In [69]:
 s6=pd.Series(['AI&ML','AI&ML','AI&ML','AI&ML'],index=[1,2,3,4])

In [70]:
print(s6)

1    AI&ML
2    AI&ML
3    AI&ML
4    AI&ML
dtype: object

In [71]:
df6=pd.DataFrame(s6,columns=["Specialization"])

In [72]:
df6

  Specialization
1          AI&ML
2          AI&ML
3          AI&ML
4          AI&ML

In [73]:
df1["Specialization"]=s6

In [74]:
df1

         Names  Age  Degree Department Specialization
1   Siddheswar   19  B.Tech        CSE          AI&ML
2  Udhayakumar   19  B.Tech        CSE          AI&ML
3        Manoj   19  B.Tech        CSE          AI&ML
4        gokul   19  B.Tech        CSE          AI&ML

In [75]:
s7=pd.Series([122012012831,122012012832,122012012833,122012012834],index=[1,2,3,4])

In [76]:
print(s7)

1    122012012831
2    122012012832
3    122012012833
4    122012012834
dtype: int64

In [77]:
df7=pd.DataFrame(s7,columns=["RegNo"])

In [78]:
df7

          RegNo
1  122012012831
2  122012012832
3  122012012833
4  122012012834

In [79]:
df1["RegNo"]=s7

In [80]:
df1

         Names  Age  Degree Department Specialization         RegNo
1   Siddheswar   19  B.Tech        CSE          AI&ML  122012012831
2  Udhayakumar   19  B.Tech        CSE          AI&ML  122012012832
3        Manoj   19  B.Tech        CSE          AI&ML  122012012833
4        gokul   19  B.Tech        CSE          AI&ML  122012012834